Долома/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <predefined>
    <items>
      <name>Животное</name>
      <description>Животное</description>
    </items>
    <items>
      <name>Молоко</name>
      <description>Молоко</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Бык</name>
    <type>
      <types>CatalogRef.БыкиПлеменные</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСемени</name>
    <type>
      <types>EnumRef.ТипыСемени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКорма</name>
    <type>
      <types>EnumRef.ВидыКормов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКорма</name>
    <type>
      <types>CatalogRef.ГруппыКормов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиницыИзмерения</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Долома/src/InformationRegisters/ТаблицаПитательностиКормов/ТаблицаПитательностиКормов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаблицаПитательностиКормов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СухоеВещество</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ОЭ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>NEL</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>XP</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>РастворимыйСП</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>РастворимыйВРубцеПротеин</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>НерастворимыйВРубцеПротеин</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>nXp</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>RNB</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>UDP</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СЗ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СЖ</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>СК</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>NDF</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ADF</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Структ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрКл</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ADL</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Крахмал</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ТранзитныйКрахмал</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Сахар</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Ca</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Na</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Mg</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>K</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>Cl</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>S</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>P</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>ПереваримоеОрганическоеВещество</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>НДКПпереваримость</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>УксуснаяКислота</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>МолочнаяКислота</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <resources>
    <name>pH</name>
    <type>
      <types>DefinedType.ПоказательПитательности</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Препарат</name>
  </enumValues>
  <enumValues>
    <name>Семя</name>
  </enumValues>
  <enumValues>
    <name>Корм</name>
  </enumValues>
  <enumValues>
    <name>ЗооТовары</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
//Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПереданныеДополнительныеПараметры = Неопределено;
		Если Параметры.Свойство("ДополнительныеПараметры", ПереданныеДополнительныеПараметры) 
				И ПереданныеДополнительныеПараметры <> Неопределено Тогда
			ВидНоменклатуры = Неопределено;
			Если ТипЗнч(ПереданныеДополнительныеПараметры) = Тип("Структура") 
					И ПереданныеДополнительныеПараметры.Свойство("ВидНоменклатуры",ВидНоменклатуры) Тогда
			     Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
					Объект.ВидНоменклатуры 	= ВидНоменклатуры;
					Объект.СтавкаНДС 		= ВидНоменклатуры.СтавкаНДС;
					Объект.ТипНоменклатуры 	= ВидНоменклатуры.ТипНоменклатуры;
					Если ЗначениеЗаполнено(ВидНоменклатуры.ЕдиницаИзмерения) Тогда
						НоваяЕдиница 					= Объект.ЕдиницыИзмерения.Добавить();
						НоваяЕдиница.ЕдиницаИзмерения 	= ВидНоменклатуры.ЕдиницаИзмерения; 
						НоваяЕдиница.Коэффициент 		= 1; 
						НоваяЕдиница.Основная 			= Истина;
						Элементы.ЕдиницыИзмеренияОсновнаяЕдиницаИзмерения.Пометка = Истина;
					    Объект.ЕдиницаИзмерения 		= ВидНоменклатуры.ЕдиницаИзмерения;
					КонецЕсли;
				 КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Отказ = Истина;
		Сообщить("Не указана основная единица измерения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьСписокПартийСемениВБыках");
	
КонецПроцедуры

&НаКлиенте
Процедура БыкПриИзменении(Элемент)
	
	СформироватьНаименованиеСемени();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСемениПриИзменении(Элемент)
	
	СформироватьНаименованиеСемени();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Элементы.ЕдиницыИзмеренияОсновнаяЕдиницаИзмерения.Пометка = ТекущиеДанные.Основная;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

//Общие процедуры

&НаКлиенте
Процедура ОсновнаяЕдиницаИзмерения(Команда)
	
	ТекущиеДанные = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения) Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПустоеОповещение", ОбщегоНазначения);
			ПоказатьПредупреждение(ОписаниеОповещения, "В строке не выбрана единица измерения. Сделать основной невозможно");
			Возврат;
			
		КонецЕсли;
		
		Если ТекущиеДанные.Основная Тогда
			
			Объект.ЕдиницаИзмерения = "";
			ТекущиеДанные.Основная = Ложь;
			Элементы.ЕдиницыИзмеренияОсновнаяЕдиницаИзмерения.Пометка = ТекущиеДанные.Основная;
			
		Иначе
			
			СтараяЕдиница = Объект.ЕдиницыИзмерения.НайтиСтроки(Новый Структура("Основная", Истина));
			
			Для  каждого СтрокаСтаройЕдиницы Из СтараяЕдиница Цикл
				
				СтрокаСтаройЕдиницы.Основная = Ложь;
				
			КонецЦикла;
			
			Объект.ЕдиницаИзмерения = ТекущиеДанные.ЕдиницаИзмерения;
			ТекущиеДанные.Основная = Истина;
			Элементы.ЕдиницыИзмеренияОсновнаяЕдиницаИзмерения.Пометка = ТекущиеДанные.Основная;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаименованиеСемени()
	
	Объект.Наименование = "" + СокрЛП(Объект.Бык) + " ("+ СокрЛП(Объект.ТипСемени) +")";
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ЭтоСемя = (Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Семя"));
	ЭтоКорм = (Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Корм"));
	Элементы.ТипСемени.Видимость 			= ЭтоСемя;
	Элементы.Бык.Видимость 					= ЭтоСемя;
	Элементы.ВидКорма.Видимость				= ЭтоКорм;
	Элементы.ГруппаКорма.Видимость			= ЭтоКорм;
	Элементы.ФормаГруппаПерейти.Видимость 	= ЭтоКорм;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
    Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.Коэффициент = 1;
		Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
			Элемент.ТекущиеДанные.Основная = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И НЕ ОтменаРедактирования Тогда
		Если Элемент.ТекущиеДанные.Основная = Истина И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЕдиницаИзмерения) Тогда
			Объект.ЕдиницаИзмерения = Элемент.ТекущиеДанные.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПитательности(Команда)  
	
	СтрОтбора = Новый Структура("Номенклатура", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", СтрОтбора);
	ОткрытьФорму("РегистрСведений.ТаблицаПитательностиКормов.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры
